code-review/NRB_3471_3546/База_Было/Documents/ПериодыПребыванияВРФ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПериодыПребыванияВРФ</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ПрисутствиеНаТерриторииРФ</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокПериодов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НачалоПериода</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонецПериода</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Местонахождение</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыМестонахожденияКлиента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Documents/ПериодыПребыванияВРФ/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	Оболочки.ПриЧтенииНаСервереДокумента(ЭтотОбъект, ТекущийОбъект);
КонецПроцедуры

//&НаКлиенте
//Процедура ПросмотрКалендаря(Команда)
//	//Календарь = Документы.ПериодыПребыванияВРФ.ПолучитьФорму("Документ.ПериодыПребыванияВРФ.Форма.ФормаПросмотраКалендаря");
//	ФормаДокумента = ПолучитьФорму("Документ.ПериодыПребыванияВРФ.Форма.ФормаКалендарь");
//	ФормаДокумента.Клиент = Объект.Клиент;
//	Календарь.Клиент = Объект.Клиент;
//	Календарь.Открыть();
//КонецПроцедуры

&НаКлиенте
Процедура СписокПериодовНачалоПериодаПриИзменении(Элемент)
	ТекущаяСтрока	= Элемент.Родитель.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекущаяСтрока.КонецПериода) И (ТекущаяСтрока.НачалоПериода >= ТекущаяСтрока.КонецПериода) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не верно указано начало периода!
										|
										|Установлена дата конца периода -1 день.");
		ТекущаяСтрока.НачалоПериода	= ТекущаяСтрока.КонецПериода-86400;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокПериодовКонецПериодаПриИзменении(Элемент)
	ТекущаяСтрока	= Элемент.Родитель.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекущаяСтрока.НачалоПериода) И (ТекущаяСтрока.НачалоПериода >= ТекущаяСтрока.КонецПериода) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не верно указано окончание периода!
										|
										|Установлена дата начала периода +1 день.");
										
		ТекущаяСтрока.КонецПериода	= ТекущаяСтрока.НачалоПериода+86400;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокПериодовПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока И Не Копирование Тогда
		Элемент.ТекущиеДанные.Местонахождение	= ПредопределенноеЗначение("Перечисление.ТипыМестонахожденияКлиента.НаТерриторииРФ");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КалендарьПрисутствия(Команда)
	Календарь = ПолучитьФорму("Документ.ПериодыПребыванияВРФ.Форма.ФормаКалендарь");	
	Календарь.Клиент		= Объект.Клиент;
	Календарь.ДатаРасчета	= ТекущаяДата();
	Календарь.Открыть();
КонецПроцедуры
